app/Models/Product_model.php

    public function getAll()
    {
        return $this->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `product`
ORDER BY `id` ASC

    public function getById($id)
    {
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `product`
WHERE `id` = '5'
 LIMIT 1